# coding:utf-8
# File Name：     test2
# Description :
# Author :       huxiaoyi
# Date：          2019-08-01
# 第二题 二维数据表格输出
# 描述
# tabulate能够对二维数据进行表格输出，是Python优秀的第三方计算生态。‪‬‪‬‪‬‪‬‪‬‮‬‫‬‫‬‪‬‪‬‪‬‪‬‪‬‮‬‭‬‪‬‪‬‪‬‪‬‪‬‪‬‮‬‪‬‫‬‪‬‪‬‪‬‪‬‪‬‮‬‪‬‮‬‪‬‪‬‪‬‪‬‪‬‮‬‪‬‮‬‪‬‪‬‪‬‪‬‪‬‮‬‪‬‮‬‪‬‪‬‪‬‪‬‪‬‮‬‫‬‪‬‪‬‪‬‪‬‪‬‪‬‮‬‫‬‫‬
#
# 参考编程模板中给定的数据和代码，编写程序，能够输出如下风格效果的表格数据
#
# +--------------+------+------+
# | 北京理工大学 | 985  | 2000 |
# +--------------+------+------+
# | 清华大学     | 985  | 3000 |
# +--------------+------+------+
# | 大连理工大学 | 985  | 4000 |
# +--------------+------+------+
# | 深圳大学     | 211  | 2000 |
# +--------------+------+------+
# | 沈阳大学     | 省本 | 2000 |
# +--------------+------+------+
# 输入输出示例
# 以下是一个格式示例，不是最终结
#
# 输入	输出
# 参考编程模板	如题干图
# 解答代码
# 思路：Google一下相关学习文档即可。可以参考以下文档：

from tabulate import tabulate


data = [ ["北京理工大学", "985", 2000], \
         ["清华大学", "985", 3000], \
         ["大连理工大学", "985", 4000], \
         ["深圳大学", "211", 2000], \
         ["沈阳大学", "省本", 2000], \
    ]
print(tabulate(data, tablefmt='grid'))