# 四位玫瑰数是4位数的自幂数。自幂数是指一个
# n
# 位数，它的每个位上的数字的
# n
# 次幂之和等于它本身。‪‬‪‬‪‬‪‬‪‬‮‬‪‬‫‬‪‬‪‬‪‬‪‬‪‬‮‬‪‬‮‬‪‬‪‬‪‬‪‬‪‬‮‬‫‬‮‬‪‬‪‬‪‬‪‬‪‬‮‬‪‬‪‬‪‬‪‬‪‬‪‬‪‬‮‬‭‬‫‬‪‬‪‬‪‬‪‬‪‬‮‬‪‬‫‬
#
# 例如：当n为3时，有1 ^ 3 + 5 ^ 3 + 3 ^ 3 = 153，153
# 即是n为3时的一个自幂数，3
# 位数的自幂数被称为水仙花数。‪‬‪‬‪‬‪‬‪‬‮‬‪‬‫‬‪‬‪‬‪‬‪‬‪‬‮‬‪‬‮‬‪‬‪‬‪‬‪‬‪‬‮‬‫‬‮‬‪‬‪‬‪‬‪‬‪‬‮‬‪‬‪‬‪‬‪‬‪‬‪‬‪‬‮‬‭‬‫‬‪‬‪‬‪‬‪‬‪‬‮‬‪‬‫‬
#
# 请输出所有4位数的四位玫瑰数，按照从大到小顺序，每个数字一行。

for num in range(1000, 9999):
    a = num // 1000
    b = (num % 1000) // 100
    c = (num % 100) // 10
    d = num % 10
    m = pow(a, 4) + pow(b, 4) + pow(c, 4) + pow(d, 4)
    if m == num:
        print(num)
